# ch 6_ SET OPERATION
****
#### KEY WORD
* UNION
* INTERSECTION
* MINUS
* ROLLUP
* CUBE
* GROUPING SETS
***

## 6-1 UNION

### < UNION >
* union은 중복된 데이터를 제거하고 하나만 출력
* 중복체크를 위해 SORT operation발생 (ORDER by절 발생)

In [1]:
import cx_Oracle
import pandas as pd
xedb = cx_Oracle.connect('hr/hr@localhost/xe')
cur = xedb.cursor()

In [2]:
df = pd.read_sql("""
        SELECT employee_id, job_id
        FROM employees
        
        UNION
        
        SELECT employee_id, job_id
        FROM job_history
        """,xedb)
print(df)

     EMPLOYEE_ID      JOB_ID
0            100     AD_PRES
1            101  AC_ACCOUNT
2            101      AC_MGR
3            101       AD_VP
4            102       AD_VP
5            102     IT_PROG
6            103     IT_PROG
7            104     IT_PROG
8            105     IT_PROG
9            106     IT_PROG
10           107     IT_PROG
11           108      FI_MGR
12           109  FI_ACCOUNT
13           110  FI_ACCOUNT
14           111  FI_ACCOUNT
15           112  FI_ACCOUNT
16           113  FI_ACCOUNT
17           114      PU_MAN
18           114    ST_CLERK
19           115    PU_CLERK
20           116    PU_CLERK
21           117    PU_CLERK
22           118    PU_CLERK
23           119    PU_CLERK
24           120      ST_MAN
25           121      ST_MAN
26           122    ST_CLERK
27           122      ST_MAN
28           123      ST_MAN
29           124      ST_MAN
..           ...         ...
85           179      SA_REP
86           180    SH_CLERK
87           181    SH_CLERK
88           182    SH_CLERK
89           183    SH_CLERK
90           184    SH_CLERK
91           185    SH_CLERK
92           186    SH_CLERK
93           187    SH_CLERK
94           188    SH_CLERK
95           189    SH_CLERK
96           190    SH_CLERK
97           191    SH_CLERK
98           192    SH_CLERK
99           193    SH_CLERK
100          194    SH_CLERK
101          195    SH_CLERK
102          196    SH_CLERK
103          197    SH_CLERK
104          198    SH_CLERK
105          199    SH_CLERK
106          200  AC_ACCOUNT
107          200     AD_ASST
108          201      MK_MAN
109          201      MK_REP
110          202      MK_REP
111          203      HR_REP
112          204      PR_REP
113          205      AC_MGR
114          206  AC_ACCOUNT

[115 rows x 2 columns]

###  < UNION ALL>
* Union all 합집합이되 중복된 데이터도 출력
* sort operation 발생하지 않음 
* 인위적으로 sort 가능(order by절)
* ORDER by절에는 첫번째 쿼리 문장의 컬럼을 사용해야, 혹은 위치표기법

In [3]:
df = pd.read_sql("""
        SELECT employee_id, job_id
        FROM employees
        
        UNION ALL
        
        SELECT employee_id, job_id
        FROM job_history
        ORDER BY 1
        """,xedb)
print(df)

     EMPLOYEE_ID      JOB_ID
0            100     AD_PRES
1            101       AD_VP
2            101  AC_ACCOUNT
3            101      AC_MGR
4            102       AD_VP
5            102     IT_PROG
6            103     IT_PROG
7            104     IT_PROG
8            105     IT_PROG
9            106     IT_PROG
10           107     IT_PROG
11           108      FI_MGR
12           109  FI_ACCOUNT
13           110  FI_ACCOUNT
14           111  FI_ACCOUNT
15           112  FI_ACCOUNT
16           113  FI_ACCOUNT
17           114      PU_MAN
18           114    ST_CLERK
19           115    PU_CLERK
20           116    PU_CLERK
21           117    PU_CLERK
22           118    PU_CLERK
23           119    PU_CLERK
24           120      ST_MAN
25           121      ST_MAN
26           122      ST_MAN
27           122    ST_CLERK
28           123      ST_MAN
29           124      ST_MAN
..           ...         ...
87           180    SH_CLERK
88           181    SH_CLERK
89           182    SH_CLERK
90           183    SH_CLERK
91           184    SH_CLERK
92           185    SH_CLERK
93           186    SH_CLERK
94           187    SH_CLERK
95           188    SH_CLERK
96           189    SH_CLERK
97           190    SH_CLERK
98           191    SH_CLERK
99           192    SH_CLERK
100          193    SH_CLERK
101          194    SH_CLERK
102          195    SH_CLERK
103          196    SH_CLERK
104          197    SH_CLERK
105          198    SH_CLERK
106          199    SH_CLERK
107          200     AD_ASST
108          200     AD_ASST
109          200  AC_ACCOUNT
110          201      MK_MAN
111          201      MK_REP
112          202      MK_REP
113          203      HR_REP
114          204      PR_REP
115          205      AC_MGR
116          206  AC_ACCOUNT

[117 rows x 2 columns]

## 6-2 INTERSECTION
* SORT operation발생

In [4]:
df = pd.read_sql("""
        SELECT employee_id, job_id
        FROM employees
        
        INTERSECT
        
        SELECT employee_id, job_id
        FROM job_history
        """,xedb)
print(df)

   EMPLOYEE_ID   JOB_ID
0          176   SA_REP
1          200  AD_ASST

## 6-3 MINUS

In [5]:
df = pd.read_sql("""
        SELECT employee_id, job_id
        FROM employees
        
        MINUS
        
        SELECT employee_id, job_id
        FROM job_history
        """,xedb)
print(df)

     EMPLOYEE_ID      JOB_ID
0            100     AD_PRES
1            101       AD_VP
2            102       AD_VP
3            103     IT_PROG
4            104     IT_PROG
5            105     IT_PROG
6            106     IT_PROG
7            107     IT_PROG
8            108      FI_MGR
9            109  FI_ACCOUNT
10           110  FI_ACCOUNT
11           111  FI_ACCOUNT
12           112  FI_ACCOUNT
13           113  FI_ACCOUNT
14           114      PU_MAN
15           115    PU_CLERK
16           116    PU_CLERK
17           117    PU_CLERK
18           118    PU_CLERK
19           119    PU_CLERK
20           120      ST_MAN
21           121      ST_MAN
22           122      ST_MAN
23           123      ST_MAN
24           124      ST_MAN
25           125    ST_CLERK
26           126    ST_CLERK
27           127    ST_CLERK
28           128    ST_CLERK
29           129    ST_CLERK
..           ...         ...
75           175      SA_REP
76           177      SA_REP
77           178      SA_REP
78           179      SA_REP
79           180    SH_CLERK
80           181    SH_CLERK
81           182    SH_CLERK
82           183    SH_CLERK
83           184    SH_CLERK
84           185    SH_CLERK
85           186    SH_CLERK
86           187    SH_CLERK
87           188    SH_CLERK
88           189    SH_CLERK
89           190    SH_CLERK
90           191    SH_CLERK
91           192    SH_CLERK
92           193    SH_CLERK
93           194    SH_CLERK
94           195    SH_CLERK
95           196    SH_CLERK
96           197    SH_CLERK
97           198    SH_CLERK
98           199    SH_CLERK
99           201      MK_MAN
100          202      MK_REP
101          203      HR_REP
102          204      PR_REP
103          205      AC_MGR
104          206  AC_ACCOUNT

[105 rows x 2 columns]

## 6-4 ROLLUP
### < 열개수, 타입 맞추기 >

    SELECT department_id, job_id, manager_id, sum(salary)
    FROM employees
    GROUP BY department_id, job_id, manager_id

    UNION ALL

    SELECT department_id, job_id, NULL, sum(salary)
    FROM employees
    GROUP BY department_id, job_id

    UNION ALL

    SELECT department_id, NULL, NULL, sum(salary)
    FROM employees
    GROUP BY department_id

    UNION ALL

    SELECT NULL, NULL, NULL, sum(salary)
    FROM employees 
    
#### 문제점 : 동일한 테이블(employees)을 4번씩이나 반복적으로 작업 ( ROLLUP으로 해결)

###  < ROLLUP >
* GROUP BY 절의 UNION 과 같다.

      GROUP BY ROLLUP(a, b, c) 는

      GROUP BY a,b,c
      UNION
      GROUP BY a,b
      UNION
      GROUP BY a
      UNION
      GROUP BY ()


* ROLLUP은 컬럼의 순서가 중요하다.
    
        {a,b,c}
        {a,b}
        {a}
        {전체}
        4개의 집계값을 차례로 출력하는 것

In [6]:
df = pd.read_sql("""
        SELECT department_id, job_id, manager_id, sum(salary)
        FROM employees
        GROUP BY ROLLUP(department_id, job_id, manager_id)
        """,xedb)
print(df)

    DEPARTMENT_ID      JOB_ID  MANAGER_ID  SUM(SALARY)
0             NaN      SA_REP       149.0         7000
1             NaN      SA_REP         NaN         7000
2             NaN        None         NaN         7000
3            10.0     AD_ASST       101.0         4400
4            10.0     AD_ASST         NaN         4400
5            10.0        None         NaN         4400
6            20.0      MK_MAN       100.0        13000
7            20.0      MK_MAN         NaN        13000
8            20.0      MK_REP       201.0         6000
9            20.0      MK_REP         NaN         6000
10           20.0        None         NaN        19000
11           30.0      PU_MAN       100.0        11000
12           30.0      PU_MAN         NaN        11000
13           30.0    PU_CLERK       114.0        13900
14           30.0    PU_CLERK         NaN        13900
15           30.0        None         NaN        24900
16           40.0      HR_REP       101.0         6500
17           40.0      HR_REP         NaN         6500
18           40.0        None         NaN         6500
19           50.0      ST_MAN       100.0        36400
20           50.0      ST_MAN         NaN        36400
21           50.0    SH_CLERK       120.0        11600
22           50.0    SH_CLERK       121.0        14700
23           50.0    SH_CLERK       122.0        12800
24           50.0    SH_CLERK       123.0        13900
25           50.0    SH_CLERK       124.0        11300
26           50.0    SH_CLERK         NaN        64300
27           50.0    ST_CLERK       120.0        10500
28           50.0    ST_CLERK       121.0        10700
29           50.0    ST_CLERK       122.0        10800
..            ...         ...         ...          ...
36           60.0     IT_PROG         NaN        28800
37           60.0        None         NaN        28800
38           70.0      PR_REP       101.0        10000
39           70.0      PR_REP         NaN        10000
40           70.0        None         NaN        10000
41           80.0      SA_MAN       100.0        61000
42           80.0      SA_MAN         NaN        61000
43           80.0      SA_REP       145.0        51000
44           80.0      SA_REP       146.0        51000
45           80.0      SA_REP       147.0        46600
46           80.0      SA_REP       148.0        51900
47           80.0      SA_REP       149.0        43000
48           80.0      SA_REP         NaN       243500
49           80.0        None         NaN       304500
50           90.0       AD_VP       100.0        34000
51           90.0       AD_VP         NaN        34000
52           90.0     AD_PRES         NaN        24000
53           90.0     AD_PRES         NaN        24000
54           90.0        None         NaN        58000
55          100.0      FI_MGR       101.0        12008
56          100.0      FI_MGR         NaN        12008
57          100.0  FI_ACCOUNT       108.0        39600
58          100.0  FI_ACCOUNT         NaN        39600
59          100.0        None         NaN        51608
60          110.0      AC_MGR       101.0        12008
61          110.0      AC_MGR         NaN        12008
62          110.0  AC_ACCOUNT       205.0         8300
63          110.0  AC_ACCOUNT         NaN         8300
64          110.0        None         NaN        20308
65            NaN        None         NaN       691416

[66 rows x 4 columns]

## 6-5 CUBE
* rollup기능 포함, 가능한 모든 조합을 집계

        {a,b,c}
        {a,b}
        {a}
        {전체}
        + {b}, {c}, {a,c}, {b,c}
* GROUP BY 절의 UNION ALL과 같다  
      GROUP BY CUBE(a, b, c) 는
 
      GROUP BY ()
      UNION ALL
      GROUP BY c
      UNION ALL
      GROUP BY b
      UNION ALL
      GROUP BY b,c
      UNION ALL
      GROUP BY a,c
      UNION ALL
      GROUP BY a,b
      UNION ALL
      GROUP BY a,b,c
* CUBE는 컬럼의 순서가 중요하지 않다.

In [7]:
df = pd.read_sql("""
        SELECT department_id, job_id, manager_id, sum(salary)
        FROM employees
        GROUP BY CUBE(department_id, job_id, manager_id)
        """,xedb)
print(df)

     DEPARTMENT_ID      JOB_ID  MANAGER_ID  SUM(SALARY)
0              NaN        None         NaN         7000
1              NaN        None         NaN        24000
2              NaN        None         NaN       691416
3              NaN        None       100.0       155400
4              NaN        None       101.0        44916
5              NaN        None       102.0         9000
6              NaN        None       103.0        19800
7              NaN        None       108.0        39600
8              NaN        None       114.0        13900
9              NaN        None       120.0        22100
10             NaN        None       121.0        25400
11             NaN        None       122.0        23600
12             NaN        None       123.0        25900
13             NaN        None       124.0        23000
14             NaN        None       145.0        51000
15             NaN        None       146.0        51000
16             NaN        None       147.0        46600
17             NaN        None       148.0        51900
18             NaN        None       149.0         7000
19             NaN        None       149.0        50000
20             NaN        None       201.0         6000
21             NaN        None       205.0         8300
22             NaN       AD_VP         NaN        34000
23             NaN       AD_VP       100.0        34000
24             NaN      AC_MGR         NaN        12008
25             NaN      AC_MGR       101.0        12008
26             NaN      FI_MGR         NaN        12008
27             NaN      FI_MGR       101.0        12008
28             NaN      HR_REP         NaN         6500
29             NaN      HR_REP       101.0         6500
..             ...         ...         ...          ...
134           80.0        None       149.0        43000
135           80.0      SA_MAN         NaN        61000
136           80.0      SA_MAN       100.0        61000
137           80.0      SA_REP         NaN       243500
138           80.0      SA_REP       145.0        51000
139           80.0      SA_REP       146.0        51000
140           80.0      SA_REP       147.0        46600
141           80.0      SA_REP       148.0        51900
142           80.0      SA_REP       149.0        43000
143           90.0        None         NaN        24000
144           90.0        None         NaN        58000
145           90.0        None       100.0        34000
146           90.0       AD_VP         NaN        34000
147           90.0       AD_VP       100.0        34000
148           90.0     AD_PRES         NaN        24000
149           90.0     AD_PRES         NaN        24000
150          100.0        None         NaN        51608
151          100.0        None       101.0        12008
152          100.0        None       108.0        39600
153          100.0      FI_MGR         NaN        12008
154          100.0      FI_MGR       101.0        12008
155          100.0  FI_ACCOUNT         NaN        39600
156          100.0  FI_ACCOUNT       108.0        39600
157          110.0        None         NaN        20308
158          110.0        None       101.0        12008
159          110.0        None       205.0         8300
160          110.0      AC_MGR         NaN        12008
161          110.0      AC_MGR       101.0        12008
162          110.0  AC_ACCOUNT         NaN         8300
163          110.0  AC_ACCOUNT       205.0         8300

[164 rows x 4 columns]

## 6-6 GROUPING SETS
* 불필요한 집계값 말고, {a,b}, {a,c}와 같이 원하는 집계값만 구할 때 사용

In [8]:
df = pd.read_sql("""
        SELECT department_id, job_id, manager_id, sum(salary)
        FROM employees
        GROUP BY GROUPING SETS( (department_id, job_id), (department_id,manager_id) )
        """,xedb)
print(df)

    DEPARTMENT_ID      JOB_ID  MANAGER_ID  SUM(SALARY)
0           110.0  AC_ACCOUNT         NaN         8300
1            90.0       AD_VP         NaN        34000
2            50.0    ST_CLERK         NaN        55700
3            80.0      SA_REP         NaN       243500
4            50.0      ST_MAN         NaN        36400
5            80.0      SA_MAN         NaN        61000
6           110.0      AC_MGR         NaN        12008
7            90.0     AD_PRES         NaN        24000
8            60.0     IT_PROG         NaN        28800
9           100.0      FI_MGR         NaN        12008
10           30.0    PU_CLERK         NaN        13900
11           50.0    SH_CLERK         NaN        64300
12           20.0      MK_MAN         NaN        13000
13          100.0  FI_ACCOUNT         NaN        39600
14            NaN      SA_REP         NaN         7000
15           70.0      PR_REP         NaN        10000
16           30.0      PU_MAN         NaN        11000
17           10.0     AD_ASST         NaN         4400
18           20.0      MK_REP         NaN         6000
19           40.0      HR_REP         NaN         6500
20           60.0        None       103.0        19800
21           80.0        None       146.0        51000
22           40.0        None       101.0         6500
23           80.0        None       145.0        51000
24           80.0        None       149.0        43000
25           70.0        None       101.0        10000
26           50.0        None       122.0        23600
27            NaN        None       149.0         7000
28           50.0        None       100.0        36400
29           50.0        None       121.0        25400
30           50.0        None       123.0        25900
31           80.0        None       147.0        46600
32          110.0        None       205.0         8300
33           90.0        None       100.0        34000
34           50.0        None       120.0        22100
35           90.0        None         NaN        24000
36           30.0        None       100.0        11000
37           10.0        None       101.0         4400
38           60.0        None       102.0         9000
39          100.0        None       101.0        12008
40           50.0        None       124.0        23000
41           80.0        None       148.0        51900
42          100.0        None       108.0        39600
43           30.0        None       114.0        13900
44           80.0        None       100.0        61000
45           20.0        None       100.0        13000
46           20.0        None       201.0         6000
47          110.0        None       101.0        12008

In [9]:
df = pd.read_sql("""
        SELECT department_id, job_id, manager_id, sum(salary)
        FROM employees
        GROUP BY GROUPING SETS((department_id, job_id), (department_id,manager_id),() )
        """,xedb)
print(df)

# ( ) : 전체집합

    DEPARTMENT_ID      JOB_ID  MANAGER_ID  SUM(SALARY)
0           110.0  AC_ACCOUNT         NaN         8300
1            90.0       AD_VP         NaN        34000
2            50.0    ST_CLERK         NaN        55700
3            80.0      SA_REP         NaN       243500
4            50.0      ST_MAN         NaN        36400
5            80.0      SA_MAN         NaN        61000
6           110.0      AC_MGR         NaN        12008
7            90.0     AD_PRES         NaN        24000
8            60.0     IT_PROG         NaN        28800
9           100.0      FI_MGR         NaN        12008
10           30.0    PU_CLERK         NaN        13900
11           50.0    SH_CLERK         NaN        64300
12           20.0      MK_MAN         NaN        13000
13          100.0  FI_ACCOUNT         NaN        39600
14            NaN      SA_REP         NaN         7000
15           70.0      PR_REP         NaN        10000
16           30.0      PU_MAN         NaN        11000
17           10.0     AD_ASST         NaN         4400
18           20.0      MK_REP         NaN         6000
19           40.0      HR_REP         NaN         6500
20            NaN        None       149.0         7000
21           10.0        None       101.0         4400
22           20.0        None       100.0        13000
23           20.0        None       201.0         6000
24           30.0        None       100.0        11000
25           30.0        None       114.0        13900
26           40.0        None       101.0         6500
27           50.0        None       100.0        36400
28           50.0        None       120.0        22100
29           50.0        None       121.0        25400
30           50.0        None       122.0        23600
31           50.0        None       123.0        25900
32           50.0        None       124.0        23000
33           60.0        None       102.0         9000
34           60.0        None       103.0        19800
35           70.0        None       101.0        10000
36           80.0        None       100.0        61000
37           80.0        None       145.0        51000
38           80.0        None       146.0        51000
39           80.0        None       147.0        46600
40           80.0        None       148.0        51900
41           80.0        None       149.0        43000
42           90.0        None         NaN        24000
43           90.0        None       100.0        34000
44          100.0        None       101.0        12008
45          100.0        None       108.0        39600
46          110.0        None       101.0        12008
47          110.0        None       205.0         8300
48            NaN        None         NaN       691416

***
# [ 연습문제 ]
***
### (1)  union 연산자 없이 union all를 이용하여 다음 문장을 수정하세요.
* union은 sort가 작업이 발생하기 때문에 중복을 만들지 않고, union all을 사용하기
* 첫번째 쿼리: 부서가 없는 사원 / 두번째쿼리: 소속사원이 없는 부서정보
    
      SELECT e.employee_id, e.last_name, d.department_name
      FROM employees e, departments d
      WHERE e.department_id = d.department_id(+)

      UNION

      SELECT e.employee_id, e.last_name, d.department_name
      FROM employees e, departments d
      WHERE e.department_id(+) = d.department_id

####  < UNION   =    UNION ALL    +    NOT EXISTS  >

In [10]:
df = pd.read_sql("""
        SELECT e.employee_id, e.last_name, d.department_name
        FROM employees e, departments d
        WHERE e.department_id = d.department_id(+)
        
        UNION ALL
        
        SELECT NULL, NULL, d.department_name
        FROM departments d
        WHERE NOT EXISTS (SELECT 'x' 
                          FROM employees e 
                          WHERE e.department_id = d.department_id)
        """,xedb)
print(df)

     EMPLOYEE_ID   LAST_NAME       DEPARTMENT_NAME
0          200.0      Whalen        Administration
1          202.0         Fay             Marketing
2          201.0   Hartstein             Marketing
3          119.0  Colmenares            Purchasing
4          118.0      Himuro            Purchasing
5          117.0      Tobias            Purchasing
6          116.0       Baida            Purchasing
7          115.0        Khoo            Purchasing
8          114.0    Raphaely            Purchasing
9          203.0      Mavris       Human Resources
10         199.0       Grant              Shipping
11         198.0    OConnell              Shipping
12         197.0      Feeney              Shipping
13         196.0       Walsh              Shipping
14         195.0       Jones              Shipping
15         194.0      McCain              Shipping
16         193.0     Everett              Shipping
17         192.0        Bell              Shipping
18         191.0     Perkins              Shipping
19         190.0       Gates              Shipping
20         189.0       Dilly              Shipping
21         188.0       Chung              Shipping
22         187.0      Cabrio              Shipping
23         186.0   Dellinger              Shipping
24         185.0        Bull              Shipping
25         184.0    Sarchand              Shipping
26         183.0       Geoni              Shipping
27         182.0    Sullivan              Shipping
28         181.0      Fleaur              Shipping
29         180.0      Taylor              Shipping
..           ...         ...                   ...
93         146.0    Partners                 Sales
94         145.0     Russell                 Sales
95         102.0     De Haan             Executive
96         101.0     Kochhar             Executive
97         100.0        King             Executive
98         113.0        Popp               Finance
99         112.0       Urman               Finance
100        111.0     Sciarra               Finance
101        110.0        Chen               Finance
102        109.0      Faviet               Finance
103        108.0   Greenberg               Finance
104        206.0       Gietz            Accounting
105        205.0     Higgins            Accounting
106        178.0       Grant                  None
107          NaN        None              Treasury
108          NaN        None         Corporate Tax
109          NaN        None    Control And Credit
110          NaN        None  Shareholder Services
111          NaN        None              Benefits
112          NaN        None         Manufacturing
113          NaN        None          Construction
114          NaN        None           Contracting
115          NaN        None            Operations
116          NaN        None            IT Support
117          NaN        None                   NOC
118          NaN        None           IT Helpdesk
119          NaN        None      Government Sales
120          NaN        None          Retail Sales
121          NaN        None            Recruiting
122          NaN        None               Payroll

[123 rows x 3 columns]

#### < OUTER JOIN >

In [11]:
df = pd.read_sql("""
        SELECT e.employee_id, e.last_name, d.department_name
        FROM employees e 
        FULL OUTER JOIN departments d
        ON e.department_id = d.department_id
        """,xedb)
print(df)

     EMPLOYEE_ID    LAST_NAME       DEPARTMENT_NAME
0          100.0         King             Executive
1          101.0      Kochhar             Executive
2          102.0      De Haan             Executive
3          103.0       Hunold                    IT
4          104.0        Ernst                    IT
5          105.0       Austin                    IT
6          106.0    Pataballa                    IT
7          107.0      Lorentz                    IT
8          108.0    Greenberg               Finance
9          109.0       Faviet               Finance
10         110.0         Chen               Finance
11         111.0      Sciarra               Finance
12         112.0        Urman               Finance
13         113.0         Popp               Finance
14         114.0     Raphaely            Purchasing
15         115.0         Khoo            Purchasing
16         116.0        Baida            Purchasing
17         117.0       Tobias            Purchasing
18         118.0       Himuro            Purchasing
19         119.0   Colmenares            Purchasing
20         120.0        Weiss              Shipping
21         121.0        Fripp              Shipping
22         122.0     Kaufling              Shipping
23         123.0      Vollman              Shipping
24         124.0      Mourgos              Shipping
25         125.0        Nayer              Shipping
26         126.0  Mikkilineni              Shipping
27         127.0       Landry              Shipping
28         128.0       Markle              Shipping
29         129.0       Bissot              Shipping
..           ...          ...                   ...
93         193.0      Everett              Shipping
94         194.0       McCain              Shipping
95         195.0        Jones              Shipping
96         196.0        Walsh              Shipping
97         197.0       Feeney              Shipping
98         198.0     OConnell              Shipping
99         199.0        Grant              Shipping
100        200.0       Whalen        Administration
101        201.0    Hartstein             Marketing
102        202.0          Fay             Marketing
103        203.0       Mavris       Human Resources
104        204.0         Baer      Public Relations
105        205.0      Higgins            Accounting
106        206.0        Gietz            Accounting
107          NaN         None                   NOC
108          NaN         None         Manufacturing
109          NaN         None      Government Sales
110          NaN         None            IT Support
111          NaN         None              Benefits
112          NaN         None  Shareholder Services
113          NaN         None          Retail Sales
114          NaN         None    Control And Credit
115          NaN         None            Recruiting
116          NaN         None            Operations
117          NaN         None              Treasury
118          NaN         None               Payroll
119          NaN         None         Corporate Tax
120          NaN         None          Construction
121          NaN         None           Contracting
122          NaN         None           IT Helpdesk

[123 rows x 3 columns]

### (2) Intersect 연산자 없이 다음 문장을 수정하세요.
* 중복을 사용하지 않고 교집합을 만들기

      SELECT employee_id, job_id
      FROM employees

      INTERSECT

      SELECT employee_id, job_id
      FROM job_history

#### < JOIN >

In [12]:
df = pd.read_sql("""
        SELECT e.employee_id, e.job_id
        FROM employees e, job_history j
        WHERE e.employee_id = j.employee_id
        AND e.job_id = j.job_id
        """,xedb)
print(df)

   EMPLOYEE_ID   JOB_ID
0          200  AD_ASST
1          176   SA_REP

#### < EXISTS >

In [13]:
df = pd.read_sql("""
        SELECT employee_id, job_id
        FROM employees e
        WHERE EXISTS (SELECT 'x' 
                      FROM job_history 
                      WHERE employee_id = e.employee_id 
                      AND job_id = e.job_id)
        """,xedb)
print(df)

   EMPLOYEE_ID   JOB_ID
0          200  AD_ASST
1          176   SA_REP

### (3) Minus 연산자 없이 다음 문장을 수정하세요
* 중복을 사용하지 않고 A-B 차집합 만들기

       SELECT employee_id, job_id
       FROM employees
          
       MINUS

       SELECT employee_id, job_id
       FROM job_history

#### < NOT EXISTS >

In [14]:
df = pd.read_sql("""
        SELECT employee_id, job_id
        FROM employees e
        WHERE NOT EXISTS (SELECT 'x' 
                          FROM job_history 
                          WHERE employee_id = e.employee_id 
                          AND job_id = e.job_id)
        """,xedb)
print(df)

     EMPLOYEE_ID      JOB_ID
0            148      SA_MAN
1            118    PU_CLERK
2            136    ST_CLERK
3            117    PU_CLERK
4            122      ST_MAN
5            158      SA_REP
6            175      SA_REP
7            142    ST_CLERK
8            101       AD_VP
9            168      SA_REP
10           115    PU_CLERK
11           131    ST_CLERK
12           173      SA_REP
13           193    SH_CLERK
14           105     IT_PROG
15           111  FI_ACCOUNT
16           205      AC_MGR
17           183    SH_CLERK
18           167      SA_REP
19           146      SA_MAN
20           186    SH_CLERK
21           149      SA_MAN
22           104     IT_PROG
23           124      ST_MAN
24           206  AC_ACCOUNT
25           171      SA_REP
26           174      SA_REP
27           128    ST_CLERK
28           134    ST_CLERK
29           164      SA_REP
..           ...         ...
75           103     IT_PROG
76           145      SA_MAN
77           170      SA_REP
78           179      SA_REP
79           107     IT_PROG
80           180    SH_CLERK
81           159      SA_REP
82           121      ST_MAN
83           203      HR_REP
84           184    SH_CLERK
85           182    SH_CLERK
86           194    SH_CLERK
87           109  FI_ACCOUNT
88           108      FI_MGR
89           161      SA_REP
90           106     IT_PROG
91           178      SA_REP
92           132    ST_CLERK
93           144    ST_CLERK
94           123      ST_MAN
95           112  FI_ACCOUNT
96           133    ST_CLERK
97           190    SH_CLERK
98           125    ST_CLERK
99           189    SH_CLERK
100          155      SA_REP
101          110  FI_ACCOUNT
102          166      SA_REP
103          199    SH_CLERK
104          172      SA_REP

[105 rows x 2 columns]

In [15]:
cur.close()
xedb.close()